{"author":"Smart Open Network","description":"# SMART Task\n\n### Overview\nSMART Task is an innovative GameFi mechanism on the Koii Network designed to validate and reward user engagement based on gameplay data. By running this task, participants actively contribute to the network while earning rewards in SMART tokens. This task encourages fair participation and authentic engagement within the GameFi ecosystem.\n\n### Objectives\n- **Data Validation:** Validate user gameplay data, including scores, game activity, and achievements.\n- **Reward Distribution:** Allocate SMART tokens based on verified gameplay actions.\n- **Community Growth:** Promote ecosystem engagement, increasing awareness and involvement in the GameFi sector.\n\n### Task Details\n- **Task ID:** `check on koii node`\n- **Platform:** Koii Network Node\n- **Network Requirements:** CPU: 4-core | RAM: 5 GB | Storage: 5 GB\n- **Reward Structure:** Based on TG_USERNAME and PlayerScore for successful validation submissions.\n- **Submission Frequency:** Every 1500 slots (~10 minutes)\n\n### Steps for Running SMART Task\n1. **Node Setup:** Download the Koii Node and set up your account (ensure enough resources).\n2. **Add SMART Task:** Add SMART Task on your Koii node by searching its Task ID or manually adding it with the SMART Task ID.\n3. **Submit Gameplay Data:** SMART Task automatically collects data from participants.\n4. **Validation & Rewards:** Data is validated, and successful entries receive SMART tokens.\n\n### Rewards\nParticipants who validate gameplay data and pass audit checks are rewarded with SMART tokens. **PlayerScore** and **TG_USERNAME** are crucial for reward calculations, ensuring each participant’s task is based on genuine engagement.\n\n### Requirements\n- **Telegram Username**: Required for identity verification and reward distribution.\n- **Minimum Stake**: 0.1 Koii token for task participation.\n  \n### FAQs\n**How do I start running the SMART Task?**  \nSimply add the SMART Task to your Koii Node, verify gameplay data, and ensure active participation.\n\n**What is PlayerScore?**  \nIt’s a metric reflecting user engagement and gameplay achievements within the ecosystem.\n\nFor additional details, visit the [SMART Task repository](https://github.com/hakikicode/SMART-Task) or contact support via social media.","repositoryUrl":"https://github.com/hakikicode/SMART-Task","createdAt":1730992375726,"migrationDescription":"This task rewards users based on validated Telegram game data, including fields like TG_USERNAME and PlayerScore. The validation process ensures that rewards correspond to accurate gameplay data submitted through Koii's decentralized node network.","imageUrl":"https://raw.githubusercontent.com/hakikicode/SMART-Task/refs/heads/master/smart%20task.png","infoUrl":"https://ipfs.io/ipfs/QmZKCxY6EECLkqyrFPRTRWiL8JCPEvLwvgFQxrpjfkU2VZ","requirementsTags":[{"type":"CPU","value":"4-core"},{"type":"RAM","value":"5 GB"},{"type":"STORAGE","value":"5 GB"},{"type":"TASK_VARIABLE","value":"TG_USERNAME","description":"add your telegram username with or without @."}],"tags":["Data Gathering","Web Crawling"],"environment":"PRODUCTION"}